[net]
batch=16
subdivisions=8
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches = 500200
policy=steps
steps=400000,450000
scales=.1,.1

[yolo]
mask = 0,1,2
anchors = 10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=2
filters=21
size=52
stride=32
activation=lrelu

[yolo]
mask = 3,4,5
anchors = 10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=2
filters=21
size=26
stride=16
activation=lrelu

[yolo]
mask = 6,7,8
anchors = 10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=2
filters=21
size=13
stride=8
activation=lrelu

[convolutional]
batch_normalize=1
filters=116
size=3
stride=1
pad=1
activation=leaky

# Downsample Layer
[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=232
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=464
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=1

[convolutional]
batch_normalize=1
filters=96
size=1
stride=1
pad=1
activation=leaky

[route]
layers = -4

[convolutional]
batch_normalize=1
filters=192
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=21
activation=linear

[yolo]
mask = 0,1,2
anchors = 10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=2
filters=21
size=52
stride=32
activation=lrelu

[route]
layers = -1,-16

[convolutional]
batch_normalize=1
filters=96
size=3
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 8

[convolutional]
batch_normalize=1
filters=96
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=21
activation=linear

[yolo]
mask = 3,4,5
anchors = 10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=2
filters=21
size=26
stride=16
activation=lrelu

[route]
layers = -1, -10

[convolutional]
batch_normalize=1
filters=96
size=3
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 4

[convolutional]
batch_normalize=1
filters=96
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=21
activation=linear

[yolo]
mask = 6,7,8
anchors = 10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=2
filters=21
size=13
stride=8
activation=lrelu
